tutorials/viscoelastic/viscoelasticFluidFoam/XPP_DE/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;

}

gradSchemes
{
    default         Gauss linear;
    grad(p)         Gauss linear;
    grad(U)         Gauss linear;

}

divSchemes
{
    default                  none;
    div(phi,U)               Gauss upwind; //GammaV 0.5;

    div(phi,Sfirst)          Gauss upwind; //Gamma 0.5;
    div(phi,Ssecond)         Gauss upwind; //Gamma 0.5;
    div(phi,Sthird)          Gauss upwind; //Gamma 0.5;
    div(phi,Sfourth)         Gauss upwind; //Gamma 0.5;
    div(phi,Sfifth)          Gauss upwind; //Gamma 0.5;
    div(phi,Ssixth)          Gauss upwind; //Gamma 0.5;

    div(phi,Lambdafirst)     Gauss upwind; //Gamma 0.5;
    div(phi,Lambdasecond)    Gauss upwind; //Gamma 0.5;
    div(phi,Lambdathird)     Gauss upwind; //Gamma 0.5;
    div(phi,Lambdafourth)    Gauss upwind; //Gamma 0.5;
    div(phi,Lambdafifth)     Gauss upwind; //Gamma 0.5;
    div(phi,Lambdasixth)     Gauss upwind; //Gamma 0.5;

    div(tau)                 Gauss linear;
}

laplacianSchemes
{
    default                      none;
    laplacian(etaPEff,U)         Gauss linear corrected;
    laplacian(etaPEff+etaS,U)    Gauss linear corrected;
    laplacian((1|A(U)),p)        Gauss linear corrected;
}

interpolationSchemes
{
    default           linear;
    interpolate(HbyA) linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    p;
}

// ************************************************************************* //
